load_tests/results_cold/run_heavy_redis.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/load_heavy.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 3 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 1/3 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 1/3 VUs  01.0s/40.0s

running (0m02.0s), 1/3 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1/3 VUs  02.0s/40.0s

running (0m03.0s), 1/3 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 1/3 VUs  03.0s/40.0s

running (0m04.0s), 1/3 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1/3 VUs  04.0s/40.0s

running (0m05.0s), 1/3 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 1/3 VUs  05.0s/40.0s

running (0m06.0s), 1/3 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 1/3 VUs  06.0s/40.0s

running (0m07.0s), 1/3 VUs, 1 complete and 0 interrupted iterations
default   [  17% ] 1/3 VUs  07.0s/40.0s

running (0m08.0s), 1/3 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 1/3 VUs  08.0s/40.0s

running (0m09.0s), 1/3 VUs, 2 complete and 0 interrupted iterations
default   [  22% ] 1/3 VUs  09.0s/40.0s

running (0m10.0s), 1/3 VUs, 2 complete and 0 interrupted iterations
default   [  25% ] 1/3 VUs  10.0s/40.0s

running (0m11.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  27% ] 1/3 VUs  11.0s/40.0s

running (0m12.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  30% ] 1/3 VUs  12.0s/40.0s

running (0m13.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  32% ] 1/3 VUs  13.0s/40.0s

running (0m14.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  35% ] 1/3 VUs  14.0s/40.0s

running (0m15.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  37% ] 1/3 VUs  15.0s/40.0s

running (0m16.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 1/3 VUs  16.0s/40.0s

running (0m17.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  42% ] 1/3 VUs  17.0s/40.0s

running (0m18.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  45% ] 1/3 VUs  18.0s/40.0s

running (0m19.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  47% ] 1/3 VUs  19.0s/40.0s

running (0m20.0s), 1/3 VUs, 3 complete and 0 interrupted iterations
default   [  50% ] 1/3 VUs  20.0s/40.0s

running (0m21.0s), 2/3 VUs, 4 complete and 0 interrupted iterations
default   [  52% ] 2/3 VUs  21.0s/40.0s

running (0m22.0s), 2/3 VUs, 4 complete and 0 interrupted iterations
default   [  55% ] 2/3 VUs  22.0s/40.0s

running (0m23.0s), 2/3 VUs, 6 complete and 0 interrupted iterations
default   [  57% ] 2/3 VUs  23.0s/40.0s

running (0m24.0s), 2/3 VUs, 6 complete and 0 interrupted iterations
default   [  60% ] 2/3 VUs  24.0s/40.0s

running (0m25.0s), 2/3 VUs, 8 complete and 0 interrupted iterations
default   [  62% ] 2/3 VUs  25.0s/40.0s

running (0m26.0s), 2/3 VUs, 8 complete and 0 interrupted iterations
default   [  65% ] 2/3 VUs  26.0s/40.0s

running (0m27.0s), 2/3 VUs, 10 complete and 0 interrupted iterations
default   [  67% ] 2/3 VUs  27.0s/40.0s

running (0m28.0s), 2/3 VUs, 10 complete and 0 interrupted iterations
default   [  70% ] 2/3 VUs  28.0s/40.0s

running (0m29.0s), 2/3 VUs, 12 complete and 0 interrupted iterations
default   [  72% ] 2/3 VUs  29.0s/40.0s

running (0m30.0s), 2/3 VUs, 12 complete and 0 interrupted iterations
default   [  75% ] 2/3 VUs  30.0s/40.0s

running (0m31.0s), 3/3 VUs, 14 complete and 0 interrupted iterations
default   [  77% ] 3/3 VUs  31.0s/40.0s

running (0m32.0s), 3/3 VUs, 14 complete and 0 interrupted iterations
default   [  80% ] 3/3 VUs  32.0s/40.0s

running (0m33.0s), 3/3 VUs, 17 complete and 0 interrupted iterations
default   [  82% ] 3/3 VUs  33.0s/40.0s

running (0m34.0s), 3/3 VUs, 17 complete and 0 interrupted iterations
default   [  85% ] 3/3 VUs  34.0s/40.0s

running (0m35.0s), 2/3 VUs, 20 complete and 0 interrupted iterations
default   [  87% ] 2/3 VUs  35.0s/40.0s

running (0m36.0s), 2/3 VUs, 20 complete and 0 interrupted iterations
default   [  90% ] 2/3 VUs  36.0s/40.0s

running (0m37.0s), 2/3 VUs, 22 complete and 0 interrupted iterations
default   [  92% ] 2/3 VUs  37.0s/40.0s

running (0m38.0s), 2/3 VUs, 22 complete and 0 interrupted iterations
default   [  95% ] 2/3 VUs  38.0s/40.0s

running (0m39.0s), 1/3 VUs, 24 complete and 0 interrupted iterations
default   [  97% ] 1/3 VUs  39.0s/40.0s

running (0m40.0s), 1/3 VUs, 24 complete and 0 interrupted iterations
default   [ 100% ] 1/3 VUs  40.0s/40.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<30000' p(95)=3.37s

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 25      0.620808/s
    checks_succeeded...: 100.00% 25 out of 25
    checks_failed......: 0.00%   0 out of 25

    ✓ status is 200

    CUSTOM
    endpoint_discover_duration.....: avg=318.157971 min=17.34764 med=17.878701 max=4219.739418 p(90)=19.257673 p(95)=1489.558229
    endpoint_top_genres_duration...: avg=726.660018 min=16.79113 med=17.636684 max=7817.839546 p(90)=18.276972 p(95)=3918.058259

    HTTP
    http_req_duration..............: avg=497.89ms   min=16.79ms  med=17.72ms   max=7.81s       p(90)=19.19ms   p(95)=3.37s      
      { expected_response:true }...: avg=497.89ms   min=16.79ms  med=17.72ms   max=7.81s       p(90)=19.19ms   p(95)=3.37s      
    http_req_failed................: 0.00%  0 out of 25
    http_reqs......................: 25     0.620808/s

    EXECUTION
    iteration_duration.............: avg=2.49s      min=2.01s    med=2.01s     max=9.81s       p(90)=2.01s     p(95)=5.38s      
    iterations.....................: 25     0.620808/s
    vus............................: 1      min=1       max=3
    vus_max........................: 3      min=3       max=3

    NETWORK
    data_received..................: 152 kB 3.8 kB/s
    data_sent......................: 2.8 kB 69 B/s



running (0m40.3s), 0/3 VUs, 25 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/3 VUs  40s